Repository: BETTEY-developers/ETool
Catalog: EliTool/Strings/*/JsonCSharpConverterPage.resw
Source language: en_us
Languages: zh_cn

# ExName.PlaceholderText
source: 想生成的类前缀
zh_cn: 想生成的类后缀

# JCC_Choose_Reset_AllOfOptions
source: Reset all of options?
zh_cn: 是否重置所有选项

# JCC_Clear_Input
source: Clear
zh_cn: 清除

# JCC_CSharpCode_IsNul
source: C# Model not genterated
zh_cn: C#代码未生成！

# JCC_Description.Text
source: This tool will help you to genterate your wish c# model.
zh_cn: 此工具将帮助您从JSON代码转换成c#实体类

# JCC_InputIsNotNul
source: Input box has content.
zh_cn: 输入框已有内容

# JCC_InputIsNotNul_Choose
source: Input box has content, clear all of content is dangerous!$LineBreak$Choose your option.
zh_cn: 输入框已有内容，清除后所有内容将会消失（真的很久！）$LineBreak$是否清除？

# JCC_NoClear_Input
source: No clear
zh_cn: 不清除

# JCC_Summon_Example_Choose
source: Input box has content, generated simple will clear all of content and fill new simple.$LineBreak$Would you?
zh_cn: 输入框已有内容，生成示例后将会覆盖$LineBreak$是否生成？

# JCC_Summon_JSON_Complated
source: Generated JSON Simple!
zh_cn: 已生成JSON代码！

# JCC_Summon_Option
source: Options
zh_cn: 选项

# Modifer.Header
source: Default protect level
zh_cn: 属性默认访问权限修饰符

# NeedAutoRename.OffContent
source: Won't auto rename
zh_cn: 不自动重命名

# NeedAutoRename.OnContent
source: Auto rename
zh_cn: 自动重命名

# NeedDoc.OffContent
source: Won't generate property doc
zh_cn: 不生成属性注释

# NeedDoc.OnContent
source: Generate property doc
zh_cn: 生成属性注释

# NeedExName.OffContent
source: Won't generate class front-name
zh_cn: 不生成类后缀

# NeedExName.OnContent
source: Generate class front-name
zh_cn: 生成类后缀

# NeedKeyDoc.Content
source: Key doc
zh_cn: 生成键注释

# NeedRawStringDoc.Content
source: Raw-string doc
zh_cn: 生成原始键值对字符串

# NeedValueDoc.Content
source: Value doc
zh_cn: 生成值注释

# OptionCard.Description
source: Set options to generate wish c# models.
zh_cn: 设置选项以生成出心仪的c#代码

# OptionCard.Header
source: Options
zh_cn: 选项

# ReplaceContent.PlaceholderText
source: Will replace wrong name character.
zh_cn: 要替换掉错误命名的字符

# ResetOption.Content
source: Reset options
zh_cn: 重置选项

# SummonTest.Content
source: Generate Simple
zh_cn: 生成测试用例
